Tekla.Structures.CatalogInternal.CDelegateSynchronized
Provides akit synchronization to CCatalogDelegate.

Tekla.Structures.CatalogInternal.CDelegateSynchronized.#ctor
DO NOT USE! For internal usage only!

Tekla.Structures.CatalogInternal.CDelegateSynchronized.InvokeRequired
DO NOT USE! For internal usage only!

Tekla.Structures.CatalogInternal.CDelegateSynchronized.BeginInvoke(System.Delegate,System.Object[])
DO NOT USE! For internal usage only!
method:
args:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.EndInvoke(System.IAsyncResult)
DO NOT USE! For internal usage only!
result:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.Invoke(System.Delegate,System.Object[])
DO NOT USE! For internal usage only!
method:
args:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.EndInvoke(Tekla.Structures.CatalogInternal.dotcatProfileItemEnumerator_t@,System.IAsyncResult)
DO NOT USE! For internal usage only!
pEnumerator:
result:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.EndInvoke(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@,System.IAsyncResult)
DO NOT USE! For internal usage only!
pProfileItem:
result:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.EndInvoke(Tekla.Structures.CatalogInternal.dotcatMaterialItemEnumerator_t@,System.IAsyncResult)
DO NOT USE! For internal usage only!
pEnumerator:
result:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.EndInvoke(Tekla.Structures.CatalogInternal.dotcatBoltItemEnumerator_t@,System.IAsyncResult)
DO NOT USE! For internal usage only!
pEnumerator:
result:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.EndInvoke(Tekla.Structures.CatalogInternal.dotcatShapeEnumerator_t@,System.IAsyncResult)
DO NOT USE! For internal usage only!
pEnumerator:
result:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.EndInvoke(Tekla.Structures.CatalogInternal.dotcatPrinterItemEnumerator_t@,System.IAsyncResult)
DO NOT USE! For internal usage only!
pEnumerator:
result:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportEnumerateProfiles(Tekla.Structures.CatalogInternal.dotcatProfileItemEnumerator_t@)
DO NOT USE! For internal usage only!
pProfileEnumerator:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportSelectProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportProfileItemToFile(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@,System.String)
DO NOT USE! For internal usage only!
pProfileItem:
ExportFile:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportProfileTreeToFile(Tekla.Structures.CatalogInternal.dotcatProfileTreePath_t@,System.String)
DO NOT USE! For internal usage only!
pProfileTreePath:
ExportFile:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportGetParametricProfilePrefixFromSubtype(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportGetProfileCrossSection(Tekla.Structures.CatalogInternal.dotcatCrossSection_t@)
DO NOT USE! For internal usage only!
pCrossSection:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportCopyProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@,Tekla.Structures.CatalogInternal.dotcatProfileName_t@)
DO NOT USE! For internal usage only!
pProfileItem:
pNewName:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportDeleteProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportModifyProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportSaveProfileDatabase
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportImportLibraryProfilesFromFolder(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportInitializeImportProfilesFromFolder(Tekla.Structures.CatalogInternal.dotcatImportItem_t@,System.Collections.Generic.List{System.Object}@)
DO NOT USE! For internal usage only!
item:
pConflicts:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportFinalizeImportProfilesFromFolder(System.Collections.Generic.List{System.Object}@)
DO NOT USE! For internal usage only!
pConflicts:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportImportParametricProfilesFromFolder(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportImportMaterialsFromFolder(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportImportCustomComponentsFromPath(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportImportRebarsFromFolder(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportImportMeshesFromFolder(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportImportBoltAssembliesFromFolder(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportEnumerateMaterials(Tekla.Structures.CatalogInternal.dotcatMaterialItemEnumerator_t@)
DO NOT USE! For internal usage only!
pMaterialEnumerator:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportSelectMaterialItem(Tekla.Structures.CatalogInternal.dotcatMaterialItem_t@)
DO NOT USE! For internal usage only!
pMaterialItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportMaterialNameMaxLength


Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportInsertMaterialItem(Tekla.Structures.CatalogInternal.dotcatMaterialItem_t@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportModifyMaterialItem(Tekla.Structures.CatalogInternal.dotcatMaterialItem_t@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportDeleteMaterialItem(Tekla.Structures.CatalogInternal.dotcatMaterialItem_t@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportMaterialExists(Tekla.Structures.CatalogInternal.dotcatMaterialItem_t@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportMaterialItemToFile(Tekla.Structures.CatalogInternal.dotcatMaterialItem_t@,System.String)
DO NOT USE! For internal usage only!
pMaterialItem:
ExportFile:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportEnumerateBolts(Tekla.Structures.CatalogInternal.dotcatBoltItemEnumerator_t@)
DO NOT USE! For internal usage only!
pBoltEnumerator:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportEnumerateBoltLengths(System.String,System.Double,System.Collections.Generic.List{System.Double}@)
DO NOT USE! For internal usage only!
Grade:
Size:
BoltLengths:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportBoltAssemblyToFile(Tekla.Structures.CatalogInternal.dotcatBoltItemExport_t@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportRebarToFile(Tekla.Structures.CatalogInternal.dotcatRebarItemExport_t@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportMeshToFile(Tekla.Structures.CatalogInternal.dotcatMeshItemExport_t@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.EnumerateShapes(Tekla.Structures.CatalogInternal.dotcatShapeEnumerator_t@)
DO NOT USE! For internal usage only!
pShapeEnumerator:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportEnumeratePrinters(Tekla.Structures.CatalogInternal.dotcatPrinterItemEnumerator_t@)
DO NOT USE! For internal usage only!
pPrinterEnumerator:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportEnumerateComponents(Tekla.Structures.CatalogInternal.dotcatComponentItemEnumerator_t@)
DO NOT USE! For internal usage only!
pComponentEnumerator:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportCustomComponentItemToFile(Tekla.Structures.CatalogInternal.dotcatComponentName_t@,System.String)
DO NOT USE! For internal usage only!
pComponentItem:
ExportFile:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportShapeItemToFile(Tekla.Structures.CatalogInternal.dotcatShape_t@,System.String)
DO NOT USE! For internal usage only!
pShapeItem:
ExportFile:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportEnumerateUserProperties(Tekla.Structures.CatalogInternal.dotcatUserPropertyItemEnumerator_t@)
DO NOT USE! For internal usage only!
pUserPropertyEnumerator:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportInsertUserPropertyItem(Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t@)
DO NOT USE! For internal usage only!
pUserPropertyItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportModifyUserPropertyItem(Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t@)
DO NOT USE! For internal usage only!
pUserPropertyItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportDeleteUserPropertyItem(Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t@)
DO NOT USE! For internal usage only!
pUserPropertyItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportSelectUserPropertyItem(Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t@)
DO NOT USE! For internal usage only!
pUserPropertyItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportSelectUserPropertyItemObjectTypes(Tekla.Structures.CatalogInternal.dotcatUserPropertyItemObjectTypes_t@)
DO NOT USE! For internal usage only!
pUserPropertyItemObjectTypes:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportUserPropertyItemObjectTypeOperation(Tekla.Structures.CatalogInternal.dotcatUserPropertyItemObjectTypeOperation_t@)
DO NOT USE! For internal usage only!
pUserPropertyItemObjectTypeOperation:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.ExportGetModelPath(System.String@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.ShapeExists(System.String)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.ShapeExistsByName(System.String)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.ImportShape(Tekla.Structures.CatalogInternal.dotcatShapeImport_t@,Tekla.Structures.CatalogInternal.dotcatShape_t@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.ShapeLocation(System.String)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.SelectShape(Tekla.Structures.CatalogInternal.dotcatShape_t@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.DeleteShape(Tekla.Structures.CatalogInternal.dotcatShape_t@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.InsertShape(Tekla.Structures.CatalogInternal.dotcatShape_t@,Tekla.Structures.CatalogInternal.dotcatShape_t@,System.Boolean)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.ModifyShape(Tekla.Structures.CatalogInternal.dotcatShape_t@,Tekla.Structures.CatalogInternal.dotcatShape_t@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.CleanAndModifyShape(Tekla.Structures.CatalogInternal.dotcatShape_t@,Tekla.Structures.CatalogInternal.dotcatShapeCleanParams_t@,System.Boolean@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.CleanAndModifyShapeByName(System.String,Tekla.Structures.CatalogInternal.dotcatShapeCleanParams_t@,System.Boolean@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.RenameShape(Tekla.Structures.CatalogInternal.dotcatShape_t@,System.String)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportEnumerateProfiles(Tekla.Structures.CatalogInternal.dotcatProfileItemEnumerator_t@)
DO NOT USE! For internal usage only!
pProfileEnumerator:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportSelectProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportProfileItemToFile(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@,System.String)
DO NOT USE! For internal usage only!
pProfileItem:
ExportFile:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportProfileTreeToFile(Tekla.Structures.CatalogInternal.dotcatProfileTreePath_t@,System.String)
DO NOT USE! For internal usage only!
pProfileTreePath:
ExportFile:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportGetParametricProfilePrefixFromSubtype(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportGetProfileCrossSection(Tekla.Structures.CatalogInternal.dotcatCrossSection_t@)
DO NOT USE! For internal usage only!
pCrossSection:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportCopyProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@,Tekla.Structures.CatalogInternal.dotcatProfileName_t@)
DO NOT USE! For internal usage only!
pProfileItem:
pNewName:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportDeleteProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportModifyProfileItem(Tekla.Structures.CatalogInternal.dotcatProfileItem_t@)
DO NOT USE! For internal usage only!
pProfileItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportSaveProfileDatabase
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportImportLibraryProfilesFromFolder(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportInitializeImportProfilesFromFolder(Tekla.Structures.CatalogInternal.dotcatImportItem_t@)
DO NOT USE! For internal usage only!
item:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportFinalizeImportProfilesFromFolder(Tekla.Structures.CatalogInternal.dotcatImportItem_t@)
DO NOT USE! For internal usage only!
item:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportImportParametricProfilesFromFolder(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportImportMaterialsFromFolder(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportImportCustomComponentsFromPath(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportImportRebarsFromFolder(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportImportMeshesFromFolder(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportImportBoltAssembliesFromFolder(System.String)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportEnumerateMaterials(Tekla.Structures.CatalogInternal.dotcatMaterialItemEnumerator_t@)
DO NOT USE! For internal usage only!
pMaterialEnumerator:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportSelectMaterialItem(Tekla.Structures.CatalogInternal.dotcatMaterialItem_t@)
DO NOT USE! For internal usage only!
pMaterialItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportMaterialNameMaxLength


Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportInsertMaterialItem(Tekla.Structures.CatalogInternal.dotcatMaterialItem_t@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportModifyMaterialItem(Tekla.Structures.CatalogInternal.dotcatMaterialItem_t@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportDeleteMaterialItem(Tekla.Structures.CatalogInternal.dotcatMaterialItem_t@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportMaterialExists(Tekla.Structures.CatalogInternal.dotcatMaterialItem_t@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportMaterialItemToFile(Tekla.Structures.CatalogInternal.dotcatMaterialItem_t@,System.String)
DO NOT USE! For internal usage only!
pMaterialItem:
ExportFile:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportEnumerateBolts(Tekla.Structures.CatalogInternal.dotcatBoltItemEnumerator_t@)
DO NOT USE! For internal usage only!
pBoltEnumerator:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportEnumerateBoltLengths(Tekla.Structures.CatalogInternal.dotcatBoltLengthEnumerator_t@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportBoltAssemblyToFile(Tekla.Structures.CatalogInternal.dotcatBoltItemExport_t@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportRebarToFile(Tekla.Structures.CatalogInternal.dotcatRebarItemExport_t@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportMeshToFile(Tekla.Structures.CatalogInternal.dotcatMeshItemExport_t@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatEnumerateShapes(Tekla.Structures.CatalogInternal.dotcatInteropShapeEnumerator_t@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportEnumeratePrinters(Tekla.Structures.CatalogInternal.dotcatPrinterItemEnumerator_t@)
DO NOT USE! For internal usage only!
pPrinterEnumerator:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportEnumerateComponents(Tekla.Structures.CatalogInternal.dotcatComponentItemEnumerator_t@)
DO NOT USE! For internal usage only!
pComponentEnumerator:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportCustomComponentItemToFile(Tekla.Structures.CatalogInternal.dotcatComponentName_t@,System.String)
DO NOT USE! For internal usage only!
pComponentItem:
ExportFile:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportShapeItemToFile(Tekla.Structures.CatalogInternal.dotcatShape_t@,System.String)
DO NOT USE! For internal usage only!
pShapeItem:
ExportFile:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportEnumerateUserProperties(Tekla.Structures.CatalogInternal.dotcatUserPropertyItemEnumerator_t@)
DO NOT USE! For internal usage only!
pUserPropertyEnumerator:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportInsertUserPropertyItem(Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t@)
DO NOT USE! For internal usage only!
pUserPropertyItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportModifyUserPropertyItem(Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t@)
DO NOT USE! For internal usage only!
pUserPropertyItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportDeleteUserPropertyItem(Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t@)
DO NOT USE! For internal usage only!
pUserPropertyItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportSelectUserPropertyItem(Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t@)
DO NOT USE! For internal usage only!
pUserPropertyItem:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportSelectUserPropertyItemObjectTypes(Tekla.Structures.CatalogInternal.dotcatUserPropertyItemObjectTypes_t@)
DO NOT USE! For internal usage only!
pUserPropertyItemObjectTypes:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatExportUserPropertyItemObjectTypeOperation(Tekla.Structures.CatalogInternal.dotcatUserPropertyItemObjectTypeOperation_t@)
DO NOT USE! For internal usage only!
pObjectTypeUserPropertyItemOperation:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotdiaGetModelPath(System.Text.StringBuilder)
DO NOT USE! For internal usage only!
Path:
Returns:

Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatImportShape(Tekla.Structures.CatalogInternal.dotcatShapeImport_t@,Tekla.Structures.CatalogInternal.dotcatShape_t@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatShapeLocation(System.String)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatSelectShape(Tekla.Structures.CatalogInternal.dotcatShape_t@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatDeleteShape(Tekla.Structures.CatalogInternal.dotcatShape_t@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatInsertShape(Tekla.Structures.CatalogInternal.dotcatShape_t@,Tekla.Structures.CatalogInternal.dotcatShape_t@,System.Boolean)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatShapeExists(System.String)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatShapeExistsByName(System.String)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatModifyShape(Tekla.Structures.CatalogInternal.dotcatShape_t@,Tekla.Structures.CatalogInternal.dotcatShape_t@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatCleanAndModifyShape(Tekla.Structures.CatalogInternal.dotcatShape_t@,Tekla.Structures.CatalogInternal.dotcatShapeCleanParams_t@,System.Boolean@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatCleanAndModifyShapeByName(System.String,Tekla.Structures.CatalogInternal.dotcatShapeCleanParams_t@,System.Boolean@)


Tekla.Structures.CatalogInternal.CDelegateSynchronized.dotcatRenameShape(Tekla.Structures.CatalogInternal.dotcatShape_t@,System.String)
